package tinkof_tasks.contest2023.task5;

/**
 * Во время разработки некоторой задачи Саша решил сгенерировать несколько новых тестов. Каждый тест Саши должен представлять собой натуральное число, не меньшее
 * l и не большее
 * r. Кроме того, натуральное число в тесте обязательно должно состоять из одинаковых цифр.
 *
 * Например, число
 * 999
 *  подходит под это требование, а число
 * 123
 * 1 — нет. Какое максимальное число различных тестов сможет создать Саша?
 *
 * Формат выходных данных
 * Выведите одно число — количество тестов, которое может сделать Саша.
 * */
 /**
 * Пример 1
 * Ввод: 4  7
 * Вывод: 4
 * Саше подходят номера 4 5 6 7
**/
 /**
 * [4,5,6,7]
 * Пример 2
 * Ввод: 10  100
 * Вывод: 9
 * Саше подходят номера: 11 22 33 44 55 66 77 88 99 - 9 штук
 **/
public class Task5 {
}
